program(0)
declaration_list(1)
declaration(0)
var
IDENTIFIER
:
type(0)
Integer
declaration_list(0)
declaration(0)
var
IDENTIFIER
:
type(0)
Integer
main
statement_list(1)
statement(0)
simple_statement(1)
assignment(0)
IDENTIFIER
<-
expression(1)
term(1)
factor(1)
CONSTANT
statement_list(1)
statement(0)
simple_statement(1)
assignment(0)
IDENTIFIER
<-
expression(1)
term(1)
factor(1)
CONSTANT
statement_list(1)
statement(0)
simple_statement(2)
io_statement(1)
write_statement(0)
write
expression(0)
term(1)
factor(0)
IDENTIFIER
math_operator1(0)
+
expression(1)
term(1)
factor(0)
IDENTIFIER
statement_list(0)
statement(1)
structural_statement(0)
if_statement(1)
simple_if_statement(0)
if
condition(0)
logical_expression(1)
expression(1)
term(1)
factor(0)
IDENTIFIER
relation(2)
=
logical_expression(0)
expression(1)
term(1)
factor(1)
CONSTANT
do
statement_list(0)
statement(0)
simple_statement(2)
io_statement(1)
write_statement(0)
write
expression(1)
term(1)
factor(1)
CONSTANT
else_statement(0)
else
do
statement_list(0)
statement(0)
simple_statement(2)
io_statement(1)
write_statement(0)
write
expression(1)
term(1)
factor(1)
CONSTANT
end
